var local_database = [
  {
    date: "Sep 05 2017",
    img: {
      avatarSrc: '/images/avatar/1.png',
      picSrc: '/images/post/crab.png'
    },
    news_title: '勒索病毒席卷100多个国家',
    news_content: '勒索病毒中招后很难挽救，疑似继续蔓延！席卷100多个国家...',
    commentNum: 12,
    readingNum: 44,
    condition: true,
    postId: 0,
    headImgSrc: '/images/post/crab.png',
    author: '欧阳时康',
    dateTime: '24小时前',
    detail: '勒索病毒席卷了美国、俄罗斯以及整个欧洲在内的100多个国家。中国难以幸免！  \n\n国内的高校内网、大型企业内网和政府机构专网中招，截至5月13日14时，国内已经有超过2.4万机器被感染。 \n \n据《华盛顿邮报》北京时间5月13日报道，今天，世界各地的医院，大公司和学校都遭到了大规模的勒索病毒攻击！Windows漏洞（永恒之蓝）让全世界无数电脑中招，要么支付赎金，要么自己宝贵的资料毁于一旦。 \n \n这种勒索软件是不法分子利用了美国国家安全局网（NSA）络武器库中泄漏出的黑客工具。据报道，英国16家医院遭到大范围网络攻击，电脑被锁定， 黑客索要每家医院支付近400万人民币赎金，否则将删除所有资料。英国国家卫生服务局（NHS）也受到了攻击，一些手术被迫取消。一名NHS工作人员告诉BBC，在其中一些案例中，病人“几乎肯定会死亡”。 \n “永恒之蓝”事件已有部分受害者直接支付赎金。然而，专家给出建议：不建议用户以支付赎金的方式解决。因为，交了赎金也不一定管用。攻击医院的丧心病狂怎么会跟你讲道理。  史上最凶，国内难以幸免  多所高校：一旦中招便无法“挽救”  欧洲刑警组织：勒索病毒黑客袭击\n\n\n',
    music: {
      dataUrl: 'http://ws.stream.qqmusic.qq.com/M500001VfvsJ21xFqb.mp3?guid=ffffffff82def4af4b12b3cd9337d5e7&uin=346897220&vkey=6292F51E1E384E06DCBDC9AB7C49FD713D632D313AC4858BACB8DDD29067D3C601481D36E62053BF8DFEAF74C0A5CCFADD6471160CAF3E6A&fromtag=46',
      title: '此时此刻-许巍',
      coverImgUrl: 'http://y.gtimg.cn/music/photo_new/T002R300x300M000003rsKF44GyaSk.jpg?max_age=2592000'
    }
  },
  {
    date: "Sep 04 2017",
    img: {
      avatarSrc: '/images/avatar/2.png',
      picSrc: '/images/post/cat.png'
    },
    news_title: '电影中的黑客几乎绝不用鼠标？',
    news_content: '电影中的黑客几乎绝不用鼠标？说起黑客，一般能想到的都是他们拥有高超的电脑技术...',
    commentNum: 3,
    readingNum: 23,
    condition: true,
    postId: 1,
    headImgSrc: '/images/post/cat.png',
    author: '欧阳时康',
    dateTime: '一天前',
    detail: '说起黑客，一般能想到的都是他们拥有高超的电脑技术，过硬的心理素质，除此之外恐怕想到最多的就是那部堪称经典特效大片的《黑客帝国》了。在影视剧中，描写黑客的电影也不在少数，这些情节大家一定都很熟悉，他们噼里啪啦一通炫酷操作，陌生人的信息有了，原本关闭的大门打开了，好好的基地爆炸了，机器人敌人都倒戈了等等。  但是，大家有没有发现一个细节，那就是黑客都不！用！鼠！标！这是为什么？我们常人都知道，鼠标是操作电脑很方便的工具，为什么黑客只需要噼里啪啦敲键盘就能完成工作呢？现实中的黑客也是这样吗？原来，国内大部分非专业人士用的都是图形界面的windows,并不熟悉命令行操作，然而windows是个不开源的系统，对于黑客来说用着不方便，相比之下，linux本来就有很多黑客贡献代码，又是来源的，所以黑客们基本都用linux。然而linux是命令行操作的，而且用命令行的速度要比图形界面快很多，比如你打开某些配置，windows下你要一层层点进去，命令行只需要一条指令，路径还能自动补全，当然更快。  黑客写工具一般为了实现某些功能，比较轻量级，一般都是命令行格式，比如shell，其次，比如vim这类文本编\n\n\n',
    music: {
      dataUrl: 'http://ws.stream.qqmusic.qq.com/C100002I8eGJ28BI17.m4a?fromtag=38',
      title: '朋友-谭咏麟',
      coverImgUrl: 'http://y.gtimg.cn/music/photo_new/T002R150x150M000004eGsCN3SUheO.jpg?max_age=2592000'
    }
  },
  {
    date: "Sep 03 2017",
    img: {
      avatarSrc: '/images/avatar/3.png',
      picSrc: '/images/post/vr.png'
    },
    news_title: 'JavaScript是否正在蚕食Python适用的场景?',
    news_content: 'Chrome V8引擎提升了js的效率,Node.js使js不再只是前端语言,NPM包管理给js不弱于pip的强大扩展...',
    commentNum: 8,
    readingNum: 56,
    condition: true,
    postId: 2,
    headImgSrc: '/images/post/vr.png',
    author: '欧阳时康',
    dateTime: '24小时前',
    detail: 'Chrome V8引擎提升了js的效率\nNode.js使js不再只是前端语言\nNPM包管理给js不弱于pip的强大扩展\nES6带来了Class和Module\nES7带来了Async/Await\nTypeScript的超集使js有了可选的静态类型和基于类的面向对象编程\nWebAssembly给了js作为胶水语言的能力\n似乎py所擅长的网络爬虫/网站后端等都是js更擅长的部分\n是否有什么使用场景是Python能更好完成而使用JavaScript无法完成的?\n从客观上JavaScript是否比Python的发展更好?\n\n\n',
    music: {
      dataUrl: 'http://ws.stream.qqmusic.qq.com/C100003507bR0gDKBm.m4a?fromtag=38',
      title: '夜夜夜夜-齐秦',
      coverImgUrl: 'http://y.gtimg.cn/music/photo_new/T002R150x150M000001TEc6V0kjpVC.jpg?max_age=2592000'
    }
  },
  {
    date: "Sep 02 2017",
    img: {
      avatarSrc: '/images/avatar/4.png',
      picSrc: '/images/post/sls.png'
    },
    news_title: '如何看待2017年6月3日凌晨微信团队开放小程序自定义关键词进行推广的功能？',
    news_content: '2017年6月3日晚，微信小程序又一新功能上线：小程序后台新增自定义关键词功能。我们都知道微信通过搜索小程序名...',
    commentNum: 20,
    readingNum: 42,
    condition: true,
    postId: 3,
    headImgSrc: '/images/post/sls.png',
    author: '欧阳时康',
    dateTime: '24小时前',
    detail: '2017年6月3日晚，微信小程序又一新功能上线：小程序后台新增自定义关键词功能。我们都知道微信通过搜索小程序名能够找到小程序，但是即使支持模糊搜索，准确找到一个小程序有时候也不容易，要是能够输入一个词就能列出一大堆相关小程序该多好啊，相信你们也这么想过吧？果然，我们开始想，微信已经开始做了。具体我们来看看具体规则：· 已发布小程序的开发者，可提交最多10个与小程序业务相关的关键词，帮助你的小程序更好地被发现。\n\n这意味着什么？就是说，以后你在微信搜索“美食”、“旅行”、“音乐”等，就能够找到设置了这些关键词的小程序了，即使这些小程序名中并没有这些词，开发者们是不是hin激动啊？你的小程序就要迎来一大波的流量红利了？先别急，我们再看看微信还说了什么。\n\n首先，关键词只能设置10个，每个月只能改3次。怎么用好这10的数量，尽量减少修改次数就够开发者烦的了。\n\n再来，不是所有的小程序都能够设置自定义关键词的，这个倒霉催的小孩就是门店小程序。\n\n接着，“关键词需与小程序本身的业务相关，必须是小程序所提供的服务，或者小程序提供服务的品牌。审核通过后，小程序的自定义关键词会和小程序服务质量、用户使用情况、关键词相关性等因素共同作用，一起影响搜索结果。不排除存在部分关键词不支持直接搜索到你的小程序的情况。”，什么意思？举个栗子，音乐类的小程序想要任性设置“美食”这个关键词，呵呵，别想了，爸爸不会允许的。还有就是，不是你设置了关键词，用户一定就能够通过这个关键词找到你的小程序的。\n\n我们想想“小程序服务质量”是什么？好的标准在哪里我们不得而知，但是坏的我们就有体会了，那些空有界面、按钮，实际上却一点内容都没有的小程序肯定算不上好的“服务质量”。\n\n好，假设现在这些小程序不能设置关键词了，一方面：用户搜索关键词的时候，避免了那些粗制滥造的小程序，留下的都是相对“服务质量”好的小程序，用户是不是就用得开心了？另一个方面：小程序开发门槛的降低，差不多是随便一个人都能开发小程序，这样就会出现各种体验不好的小程序，而开发者想要让自己的小程序能够更大程度的曝光的话，就要提升小程序的质量，嗯，这条规则就是鞭策开发者好好干的那条“鞭”。\n\n“用户使用情况”又是什么东西？小编现在能想到的就是小程序被使用的频率了，哪个小程序使用的频率高，关键词搜索的时候就会排更前的位置。这个与“关键词相关性”就要结合在一起了，一个高频使用的小程序例如记账类小程序（含旅游记账功能）如果和低频使用纯旅游类小程序（酒店民宿预定等）设置了同样的“旅行”关键词的话，明显纯旅游类的小程序就要大大吃亏了嘛。所以，微信就让同类型的小程序去拼个你死我活了，不同类型的不要一起玩。\n\n然后我们来想想最关键的一个词——搜索，设置了再好的关键词，没有人去搜索照样没用。小程序的搜索不比我们在百度、在淘宝上的搜索一样，用户没有在微信时不时就搜一搜的习惯，所以现在小程序入口最多的还是公众号，因为这里有巨大的流量，一旦转化有效，可想而知，这是多么大的一笔流量红利啊！\n\n这又不得不说一下，微信的搜一搜、看一看了，继iOS的更新之后，安卓版也更新了新版本，新增实验室功能。在这种时候，开放小程序的关键词搜索功能，有没有一点微妙的感觉呢？小程序有了关键词，就需要用户去搜索，用户没搜索习惯，我就创造习惯。不得不说，微信一出手都是环环相扣的。。\n\n\n',
    music: {
      dataUrl: 'http://ws.stream.qqmusic.qq.com/C100003GdCmG4NkEOR.m4a?fromtag=38',
      title: '鬼迷心窍-李宗盛',
      coverImgUrl: 'http://y.gtimg.cn/music/photo_new/T002R150x150M000002xOmp62kqSic.jpg?max_age=2592000'
    }
  },
  {
    date: "Sep 01 2017",
    img: {
      avatarSrc: '/images/avatar/5.png',
      picSrc: '/images/post/bl.png'
    },
    news_title: '集美大学校歌',
    news_content: '闽海之滨，有我集美乡，山明兮水秀，胜地冠南疆。天然位置，惟序与黉，英才乐育，蔚为国光...',
    commentNum: 65,
    readingNum: 92,
    condition: true,
    postId: 4,
    headImgSrc: '/images/post/bl.png',
    author: '欧阳时康',
    dateTime: '24小时前',
    detail: '闽海之滨，有我集美乡，\n山明兮水秀，胜地冠南疆。\n天然位置，惟序与黉，\n英才乐育，蔚为国光。全国士聚一堂。\n师中实小共提倡，春风吹和煦，\n桃李尽成行，树人需百年，美哉教泽长。\n"诚毅"二字中心藏，大家勿忘，大家勿忘!\n\n闽海之滨，有我集美乡，\n山明兮水秀，胜地冠南疆。\n天然位置，惟序与黉，\n英才乐育，蔚为国光。全国士聚一堂。\n师中实小共提倡，春风吹和煦，\n桃李尽成行，树人需百年美哉教泽长。\n"诚毅"二字中心藏，大家勿忘，大家勿忘!\n\n\n',
    music: {
      dataUrl: 'http://ws.stream.qqmusic.qq.com/C100000Zn0vS4fKKo8.m4a?fromtag=38',
      title: '沉默是金-张国荣',
      coverImgUrl: 'http://y.gtimg.cn/music/photo_new/T002R150x150M000003at0mJ2YrR2H.jpg?max_age=2592000'
    }
  },
  {
    date: "Sep 01 2016",
    img: {
      avatarSrc: '/images/avatar/1.png',
      picSrc: '/images/post/mv.png'
    },
    news_title: '单身时间长了是个什么感觉？',
    news_content: '这让我想起了奇葩说的一道辩题，剩男剩女该不该差不多得了。胡建彪的一段话：“我们之所以单到今天...',
    commentNum: 25,
    readingNum: 62,
    condition: true,
    postId: 5,
    headImgSrc: '/images/post/mv.png',
    author: 'oysk',
    dateTime: '24小时前',
    detail: '这让我想起了奇葩说的一道辩题，剩男剩女该不该差不多得了。胡建彪的一段话：“我们之所以单到今天，我们内心一定有一个很不愿意割舍的标准，这个标准不是抽不抽烟，喝不喝酒，是不是高富帅？那是20多岁的人心中会想的，剩男剩女坚持单身下去的原因，因为我们有自己的人生经历，我们需要一个能够包容我们经历的人，也许是因为我们性格的某些特点，我们需要有一个人能够由衷的接受和懂我们。我们心中放不下的标准是没那么简单就能找到一个聊了来的伴。这才是我们心中坚持的，一个人孤独终老，很可怕，更可怕的是两个人一起孤独终老。\n少年夫妻老来伴，中年夫妻怎么办？你好不容易找了一个男的，每天下班，不愿意回家，宁愿在外面逛，女的自己在家没事干，养成追看韩剧的习惯，他们很孤独，差不多解决不了你的孤独，你只不过是把一人份的孤独酿成两人份的孤单”。\n\n对于爱情偏执的你可能会想，如果我们能嫁给爱情，晚一点又有什么关系，时间长又如何？\n之前有个考研的朋友说：单身久了，我依然很自在，没有人约束，周末想去哪玩就可以去，虽然有时一个人感觉怪怪的，但人生最好的朋友不就是自己吗？你多陪陪他，了解他。\n\n接着说我曾经有一个女朋友，开支挺大的，现在开支都花在自己身上，何乐而不为？比如我可以多存点钱做自己想做的事情，多看书。其实看着校园的情侣也没那么羡慕，虽然他们看着很幸福，其实家家都有难念的经，虽然有点阿q精神。努力提升自己吧，多看点专业书，遇见前任的时候你已经经济和人格都独立了，积累自己的资产和兴趣，变成一个有趣稳重的人，试问这事你还怕吸引不到对象吗？否则那就是你活该单身。\n\n我很赞同他的观点，其实我非常喜欢这句话，你若盛开，清风自来。多数读书，让自己变得更加优秀，直到有一天遇到自己喜欢的人可以不那么自卑到尘埃，能自信的对她说我同样配得上你的优秀。多读书让我们不仅独立，而且知道自己想要什么，通过自己的知识和经验，远离那些令人煎熬带来痛苦的人，避免那些不必要的伤害。\n\n在此，不是鼓励大家拿出把单身进行到底的决心，我们谁都不想做一辈子的单身狗，单身久了感觉很孤独，总想找个伴说一些其他人说不了的话，单纯的谈一场恋爱本来就是很愉快的事情，爱情本来就该是美好的，神秘的，有期待感的，单身其实不可怕，可怕的是你未来没有盼头，就像前几期奇葩说胡建彪的一段话，让我有所触动。我们不应该跟随别人的期待，活成别人眼中的自己，我们不需要达到别人预期的样子，你可以做你自己的事，你有自己喜欢的人吗，喜欢的事情吗，有自己梦寐以求的未来吗，喜欢就去坚持。\n\n\n',
    music: {
      dataUrl: 'http://ws.stream.qqmusic.qq.com/C100004HLusI2lLjZy.m4a?fromtag=38',
      title: '女儿情-万晓利',
      coverImgUrl: 'http://y.gtimg.cn/music/photo_new/T002R150x150M000004Wv5BO30pPc0.jpg?max_age=2592000'
    }
  },
  {
    date: "Sep 06 2016",
    img: {
      avatarSrc: '/images/avatar/2.png',
      picSrc: '/images/iqiyi.png'
    },
    news_title: 'VR全景智慧城市：全景技术分析与研究',
    news_content: '全景智慧城市，多年从事三维全景技术应用的互联网公司，我们利用计算机图形学、多媒体、人工智能和计算机网络技术...',
    commentNum: 25,
    readingNum: 62,
    condition: true,
    postId: 6,
    headImgSrc: '/images/iqiyi.png',
    author: 'oysk',
    dateTime: '24小时前',
    detail: '全景智慧城市，多年从事三维全景技术应用的互联网公司，我们利用计算机图形学、多媒体、人工智能和计算机网络技术，深入研发和推广虚拟现实9VR0技术的行业应用。如官方网站升级+720度全景、微网站建设+720度全景、APP制作+720度全景等，我们以优质的服务、国际领先的技术团队，为您定制全方位解决方案。720全景技术是基于真实场景的虚拟现实技术，可以让你从全方位的视角观察现场实景，身临其境的感觉是平面照片和三维重建都无法做到的。我们利用三维全景虚拟现实技术，制作成交互式720度全景虚拟漫游让你的产品更好地通过网络技术展现给您的客户，是提升您品牌形象的最佳呈现方式。\n\n全景(Panorama)技术是一种基于图像绘制技术生成真实感图形的虚拟现实技术,它的基本数据表示是由一组光学观察组成的,不需要明确的几何表示就能提供令人信服的效果[1].全景技术是目前全球范围内迅速发展并逐步流行的一种视觉新技术,它给人们带来全新的真实现场感和交互的感受[2].随着电子商务的日益普及,在线产品展示、虚拟实景、虚拟物体等的不断发展,人们已不仅仅满足于简单的文字介绍和图形展示,对其交互性和真实性有了更高的需求.它可广泛应用于三维电子商务,如在线的房地产楼盘展示、虚拟旅游、虚拟教育等领域.针对三维全景(虚拟现实VR)技术,提供一套全面的解决方案,非常好地满足这类需求,将给电子商务现实化注入新的活力,使互联网络更加精彩\n\nVR全景技术可应用于网站建设、多媒体光盘制作、电子商务、房地产展示、虚拟旅游、地理信息系统、宾馆酒店、虚拟展览等领域.房屋开发销售公司利用虚拟全景浏览技术展示楼盘的外观、房屋的结构、布局、室内设计,购房者在家中通过网络即可仔细查看房屋的各个方面,提高潜在客户群.宾馆可以利用网络,远程虚拟浏览宾馆的外形、大厅、客房、会议厅等各服务场所,展现宾馆舒适的环境,完善的服务,给房客以实在感受,促进客户预定客房,同时也是展示酒店形象的有效手段.现代化的城市可以通过网络的虚拟浏览技术向世界展示城市的迷人风貌,吸引旅游和投资者.经典旅行社可以用优美的360度全景照片,显示景区内的优美景点,给旅游者以身临其境的感觉,制作风景区的介绍光盘,也可以作为旅游公司吸引游客的绝好工具.󰀂互动虚拟物体 (VRO)技术使公司可以向客户提供更丰富的多媒体形式,用画和3D全景,来展示商品优点,吸引客户购买.3D全方位浏览技术大大提高了网络购物的可信程度,是电子商务站点的有利助手。\n\n\n',
    music: {
      dataUrl: 'http://ws.stream.qqmusic.qq.com/C100004HLusI2lLjZy.m4a?fromtag=38',
      title: '女儿情-万晓利',
      coverImgUrl: 'http://y.gtimg.cn/music/photo_new/T002R150x150M000004Wv5BO30pPc0.jpg?max_age=2592000'
    }
  },
  {
    date: "Sep 07 2016",
    img: {
      avatarSrc: '/images/avatar/1.png',
      picSrc: '/images/vr.png'
    },
    news_title: '中国与世界人工智能的未来',
    news_content: '3月19日腾讯的绝艺，在日本东京第十届围棋机器人大赛中一举夺冠，这件事引起我的思考。因为有意思的是绝对是由一组年轻人做的，这些年轻人没有一个人懂围棋...',
    commentNum: 25,
    readingNum: 62,
    condition: true,
    postId: 7,
    headImgSrc: '/images/vr.png',
    author: 'oysk',
    dateTime: '24小时前',
    detail: '说什么呢？一件事让我深刻地思考。3月19日腾讯的绝艺，在日本东京第十届围棋机器人大赛中一举夺冠，这件事引起我的思考。因为有意思的是绝对是由一组年轻人做的，这些年轻人没有一个人懂围棋，这是典型的在人工智能里面的中国人的论证，如果给机器规则和信息机器就能运转。我觉得这个超越AlphaGo。\n\n第二件事情，中国人又一次走到了世界的舞台，中国人在人工智能领域确实有优势，或者广义上说的华人。大家也许知道，也许不知道，AlphaGo后面主导的研究员黄博士是华人，当然他本人是一个6段的棋手。而这次的“绝艺”又是年轻的中国人，我特别感兴趣的是这个名字“绝艺”，我觉得这是中国人在人工智能领域中应有的气势和高度。祝贺马化腾先生。\n\n我今天讲的题目是“中国与世界人工智能的未来”，我想讲三个方面，人工智能在中国、人工智能的未来，中国与世界人工智能的未来。\n\n第一个人工智能在中国是方兴未艾、如火如荼，在所有今天人工智能的领域，从机器人到智能金融、智能医疗、智能安防，现在是几千亿的市场，智能家居几十家公司在做，智能教育、智慧城市，到后面已经有了深度学习、推荐引擎、收拾控制、计算机视觉、语言识别、语义识别、自动驾驶，所有这些东西都能在中国找到，在世界上没有任何一个国家有中国如此的人工智能进步。\n\n人工智能将使每一个人变得效率更高，如菜鸟人工智能的配送机器人。中国电信开始利用他广泛的网络建设智慧城市。中国电信做金融，他有3亿的账户，做电信的开始做金融，这在以前是不可想象的事情。\n\n百度是最早从事人工智能的企业，百度脑四大功能，自然语言处理达到28种，人脸识别率达到99.7%。\n\n人工智能在中国确实是如火如荼。以色列一位朋友告诉我，他说在全世界从来没有看到中国在人工智能是如此热烈、如此发展。他说在今天的世界上，人工智能其实是存在于中国和美国之间，他说中国的发展一定有未来。所以人工智能毫无疑问在中国具有非常大的市场。\n\n人工智能的未来在哪里？关于人工智能的未来有很多，基本的概念，从当前狭义的，从ANI到AGI到ASI，这是当前的路径的之一，到ASI的时候智能爆炸，可能出现很恐怖的效果。AI+HI=SI，这是机器的智能和人的智能结合。\n\n潜艇会游泳吗？问题是它会不会思考？如果它有这个（思考）功能，机器也可以比人强。人工会改进自己的智能，重写程序，调试代码、修复错误？AI会对IQ测试和改进，使自己拥有更多的IQ和EQ。机器有价值观吗？现在facebook和谷歌的机器学习已经初步显示了情感，比如他会拒绝你，他会骂你。如果机器赋权人类，使人类更具有创造力和想象力，那机器和人谁主沉浮？机器有机器权吗？就像人权一样.....\n\n\n',
    music: {
      dataUrl: 'http://ws.stream.qqmusic.qq.com/C100004HLusI2lLjZy.m4a?fromtag=38',
      title: '女儿情-万晓利',
      coverImgUrl: 'http://y.gtimg.cn/music/photo_new/T002R150x150M000004Wv5BO30pPc0.jpg?max_age=2592000'
    }
  },
  {
    date: "Sep 08 2016",
    img: {
      avatarSrc: '/images/avatar/1.png',
      picSrc: '/images/wx.png'
    },
    news_title: '让我们从机器学习谈起',
    news_content: '机器学习这个词是让人疑惑的，首先它是英文名称Machine Learning(简称ML)的直译，在计算界Machine一般指计算机。这个名字使用了拟人的手法...',
    commentNum: 25,
    readingNum: 62,
    condition: true,
    postId: 8,
    headImgSrc: '/images/wx.png',
    author: 'oysk',
    dateTime: '24小时前',
    detail: '机器学习这个词是让人疑惑的，首先它是英文名称Machine Learning(简称ML)的直译，在计算界Machine一般指计算机。这个名字使用了拟人的手法，说明了这门技术是让机器“学习”的技术。但是计算机是死的，怎么可能像人类一样“学习”呢？\n\n传统上如果我们想让计算机工作，我们给它一串指令，然后它遵照这个指令一步步执行下去。有因有果，非常明确。但这样的方式在机器学习中行不通。机器学习根本不接受你输入的指令，相反，它接受你输入的数据! 也就是说，机器学习是一种让计算机利用数据而不是指令来进行各种工作的方法。这听起来非常不可思议，但结果上却是非常可行的。“统计”思想将在你学习“机器学习”相关理念时无时无刻不伴随，相关而不是因果的概念将是支撑机器学习能够工作的核心概念。你会颠覆对你以前所有程序中建立的因果无处不在的根本理念。\n\n下面我通过一个故事来简单地阐明什么是机器学习。这个故事比较适合用在知乎上作为一个概念的阐明。在这里，这个故事没有展开，但相关内容与核心是存在的。如果你想简单的了解一下什么是机器学习，那么看完这个故事就足够了。如果你想了解机器学习的更多知识以及与它关联紧密的当代技术，那么请你继续往下看，后面有更多的丰富的内容。\n\n这个例子来源于我真实的生活经验，我在思考这个问题的时候突然发现它的过程可以被扩充化为一个完整的机器学习的过程，因此我决定使用这个例子作为所有介绍的开始。这个故事称为“等人问题”。\n\n我相信大家都有跟别人相约，然后等人的经历。现实中不是每个人都那么守时的，于是当你碰到一些爱迟到的人，你的时间不可避免的要浪费。我就碰到过这样的一个例子\n\n要想解决这个问题，有好几种方法。第一种方法是采用知识：我搜寻能够解决这个问题的知识。但很遗憾，没有人会把如何等人这个问题作为知识传授，因此我不可能找到已有的知识能够解决这个问题。第二种方法是问他人：我去询问他人获得解决这个问题的能力。但是同样的，这个问题没有人能够解答，因为可能没人碰上跟我一样的情况。第三种方法是准则法：我问自己的内心，我有否设立过什么准则去面对这个问题？例如，无论别人如何，我都会守时到达。但我不是个死板的人，我没有设立过这样的规则。\n\n\n',
    music: {
      dataUrl: 'http://ws.stream.qqmusic.qq.com/C100004HLusI2lLjZy.m4a?fromtag=38',
      title: '女儿情-万晓利',
      coverImgUrl: 'http://y.gtimg.cn/music/photo_new/T002R150x150M000004Wv5BO30pPc0.jpg?max_age=2592000'
    }
  }
];

module.exports = {
  newsList: local_database
}